basic/controllers/OrderController.php

SELECT * FROM `myjd2_order_detail` WHERE orderid = 1
---
    public function actionCheck()
    {
        if (Yii::$app->session['isLogin'] != 1) {
            return $this->redirect(['member/auth']);
        }
        $orderid = (int) Yii::$app->request->get('orderid');
        $status = Order::find()->where('orderid = :oid', [':oid' => $orderid])->one()->status;//查出单条数据中单个字段的值
        if ($status != Order::CREATEORDER && $status != Order::CHECKORDER) {//CHECKORDER?
            return $this->redirect(['order/index']);
        }
        $loginname = Yii::$app->session['loginname'];
        $userid = User::find()->where('username = :name or useremail = :email', [':name' => $loginname, ':email' => $loginname])->one()->userid;
        $addresses = Address::find()->where('userid = :uid', [':uid' => $userid])->asArray()->all();

        $details = OrderDetail::find()->where('orderid = :oid', [':oid' => $orderid])->asArray()->all();